load_test/results/20260420_194844/stress_vus10.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: async_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 3m30s max duration (incl. graceful stop):
              * stress: 10 looping VUs for 3m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   1% ] 10 VUs  0m01.0s/3m0s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   1% ] 10 VUs  0m02.0s/3m0s

running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 10 VUs  0m03.0s/3m0s

running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 10 VUs  0m04.0s/3m0s

running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   3% ] 10 VUs  0m05.0s/3m0s

running (0m06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   3% ] 10 VUs  0m06.0s/3m0s

running (0m07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   4% ] 10 VUs  0m07.0s/3m0s

running (0m08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   4% ] 10 VUs  0m08.0s/3m0s

running (0m09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   5% ] 10 VUs  0m09.0s/3m0s

running (0m10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   6% ] 10 VUs  0m10.0s/3m0s

running (0m11.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   6% ] 10 VUs  0m11.0s/3m0s

running (0m12.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   7% ] 10 VUs  0m12.0s/3m0s

running (0m13.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   7% ] 10 VUs  0m13.0s/3m0s

running (0m14.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   8% ] 10 VUs  0m14.0s/3m0s

running (0m15.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   8% ] 10 VUs  0m15.0s/3m0s

running (0m16.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   9% ] 10 VUs  0m16.0s/3m0s

running (0m17.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [   9% ] 10 VUs  0m17.0s/3m0s

running (0m18.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  10% ] 10 VUs  0m18.0s/3m0s

running (0m19.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  11% ] 10 VUs  0m19.0s/3m0s

running (0m20.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  11% ] 10 VUs  0m20.0s/3m0s

running (0m21.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  12% ] 10 VUs  0m21.0s/3m0s

running (0m22.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  12% ] 10 VUs  0m22.0s/3m0s

running (0m23.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  13% ] 10 VUs  0m23.0s/3m0s

running (0m24.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  13% ] 10 VUs  0m24.0s/3m0s

running (0m25.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  14% ] 10 VUs  0m25.0s/3m0s

running (0m26.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  14% ] 10 VUs  0m26.0s/3m0s

running (0m27.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  15% ] 10 VUs  0m27.0s/3m0s

running (0m28.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  16% ] 10 VUs  0m28.0s/3m0s

running (0m29.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  16% ] 10 VUs  0m29.0s/3m0s

running (0m30.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  17% ] 10 VUs  0m30.0s/3m0s

running (0m31.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
stress   [  17% ] 10 VUs  0m31.0s/3m0s

running (0m32.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  18% ] 10 VUs  0m32.0s/3m0s

running (0m33.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  18% ] 10 VUs  0m33.0s/3m0s

running (0m34.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  19% ] 10 VUs  0m34.0s/3m0s

running (0m35.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  19% ] 10 VUs  0m35.0s/3m0s

running (0m36.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  20% ] 10 VUs  0m36.0s/3m0s

running (0m37.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  21% ] 10 VUs  0m37.0s/3m0s

running (0m38.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  21% ] 10 VUs  0m38.0s/3m0s

running (0m39.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  22% ] 10 VUs  0m39.0s/3m0s

running (0m40.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  22% ] 10 VUs  0m40.0s/3m0s

running (0m41.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  23% ] 10 VUs  0m41.0s/3m0s

running (0m42.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  23% ] 10 VUs  0m42.0s/3m0s

running (0m43.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  24% ] 10 VUs  0m43.0s/3m0s

running (0m44.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  24% ] 10 VUs  0m44.0s/3m0s

running (0m45.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  25% ] 10 VUs  0m45.0s/3m0s

running (0m46.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  26% ] 10 VUs  0m46.0s/3m0s

running (0m47.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  26% ] 10 VUs  0m47.0s/3m0s

running (0m48.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  27% ] 10 VUs  0m48.0s/3m0s

running (0m49.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  27% ] 10 VUs  0m49.0s/3m0s

running (0m50.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  28% ] 10 VUs  0m50.0s/3m0s

running (0m51.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  28% ] 10 VUs  0m51.0s/3m0s

running (0m52.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  29% ] 10 VUs  0m52.0s/3m0s

running (0m53.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  29% ] 10 VUs  0m53.0s/3m0s

running (0m54.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  30% ] 10 VUs  0m54.0s/3m0s

running (0m55.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  31% ] 10 VUs  0m55.0s/3m0s

running (0m56.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  31% ] 10 VUs  0m56.0s/3m0s

running (0m57.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  32% ] 10 VUs  0m57.0s/3m0s

running (0m58.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  32% ] 10 VUs  0m58.0s/3m0s

running (0m59.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  33% ] 10 VUs  0m59.0s/3m0s

running (1m00.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  33% ] 10 VUs  1m00.0s/3m0s

running (1m01.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  34% ] 10 VUs  1m01.0s/3m0s

running (1m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
stress   [  34% ] 10 VUs  1m02.0s/3m0s

running (1m03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  35% ] 10 VUs  1m03.0s/3m0s

running (1m04.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  36% ] 10 VUs  1m04.0s/3m0s

running (1m05.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  36% ] 10 VUs  1m05.0s/3m0s

running (1m06.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  37% ] 10 VUs  1m06.0s/3m0s

running (1m07.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  37% ] 10 VUs  1m07.0s/3m0s

running (1m08.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  38% ] 10 VUs  1m08.0s/3m0s

running (1m09.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  38% ] 10 VUs  1m09.0s/3m0s

running (1m10.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  39% ] 10 VUs  1m10.0s/3m0s

running (1m11.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  39% ] 10 VUs  1m11.0s/3m0s

running (1m12.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  40% ] 10 VUs  1m12.0s/3m0s

running (1m13.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  41% ] 10 VUs  1m13.0s/3m0s

running (1m14.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  41% ] 10 VUs  1m14.0s/3m0s

running (1m15.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  42% ] 10 VUs  1m15.0s/3m0s

running (1m16.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  42% ] 10 VUs  1m16.0s/3m0s

running (1m17.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  43% ] 10 VUs  1m17.0s/3m0s

running (1m18.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  43% ] 10 VUs  1m18.0s/3m0s

running (1m19.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  44% ] 10 VUs  1m19.0s/3m0s

running (1m20.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  44% ] 10 VUs  1m20.0s/3m0s

running (1m21.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  45% ] 10 VUs  1m21.0s/3m0s

running (1m22.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  46% ] 10 VUs  1m22.0s/3m0s

running (1m23.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  46% ] 10 VUs  1m23.0s/3m0s

running (1m24.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  47% ] 10 VUs  1m24.0s/3m0s

running (1m25.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  47% ] 10 VUs  1m25.0s/3m0s

running (1m26.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  48% ] 10 VUs  1m26.0s/3m0s

running (1m27.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  48% ] 10 VUs  1m27.0s/3m0s

running (1m28.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  49% ] 10 VUs  1m28.0s/3m0s

running (1m29.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  49% ] 10 VUs  1m29.0s/3m0s

running (1m30.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  50% ] 10 VUs  1m30.0s/3m0s

running (1m31.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  51% ] 10 VUs  1m31.0s/3m0s

running (1m32.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  51% ] 10 VUs  1m32.0s/3m0s

running (1m33.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
stress   [  52% ] 10 VUs  1m33.0s/3m0s

running (1m34.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  52% ] 10 VUs  1m34.0s/3m0s

running (1m35.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  53% ] 10 VUs  1m35.0s/3m0s

running (1m36.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  53% ] 10 VUs  1m36.0s/3m0s

running (1m37.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  54% ] 10 VUs  1m37.0s/3m0s

running (1m38.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  54% ] 10 VUs  1m38.0s/3m0s

running (1m39.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  55% ] 10 VUs  1m39.0s/3m0s

running (1m40.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  56% ] 10 VUs  1m40.0s/3m0s

running (1m41.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  56% ] 10 VUs  1m41.0s/3m0s

running (1m42.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  57% ] 10 VUs  1m42.0s/3m0s

running (1m43.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  57% ] 10 VUs  1m43.0s/3m0s

running (1m44.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  58% ] 10 VUs  1m44.0s/3m0s

running (1m45.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  58% ] 10 VUs  1m45.0s/3m0s

running (1m46.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  59% ] 10 VUs  1m46.0s/3m0s

running (1m47.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  59% ] 10 VUs  1m47.0s/3m0s

running (1m48.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  60% ] 10 VUs  1m48.0s/3m0s

running (1m49.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  61% ] 10 VUs  1m49.0s/3m0s

running (1m50.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  61% ] 10 VUs  1m50.0s/3m0s

running (1m51.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  62% ] 10 VUs  1m51.0s/3m0s

running (1m52.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  62% ] 10 VUs  1m52.0s/3m0s

running (1m53.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  63% ] 10 VUs  1m53.0s/3m0s

running (1m54.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  63% ] 10 VUs  1m54.0s/3m0s

running (1m55.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  64% ] 10 VUs  1m55.0s/3m0s

running (1m56.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  64% ] 10 VUs  1m56.0s/3m0s

running (1m57.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  65% ] 10 VUs  1m57.0s/3m0s

running (1m58.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  66% ] 10 VUs  1m58.0s/3m0s

running (1m59.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  66% ] 10 VUs  1m59.0s/3m0s

running (2m00.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  67% ] 10 VUs  2m00.0s/3m0s

running (2m01.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  67% ] 10 VUs  2m01.0s/3m0s

running (2m02.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  68% ] 10 VUs  2m02.0s/3m0s

running (2m03.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  68% ] 10 VUs  2m03.0s/3m0s

running (2m04.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
stress   [  69% ] 10 VUs  2m04.0s/3m0s

running (2m05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  69% ] 10 VUs  2m05.0s/3m0s

running (2m06.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  70% ] 10 VUs  2m06.0s/3m0s

running (2m07.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  71% ] 10 VUs  2m07.0s/3m0s

running (2m08.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  71% ] 10 VUs  2m08.0s/3m0s

running (2m09.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  72% ] 10 VUs  2m09.0s/3m0s

running (2m10.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  72% ] 10 VUs  2m10.0s/3m0s

running (2m11.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  73% ] 10 VUs  2m11.0s/3m0s

running (2m12.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  73% ] 10 VUs  2m12.0s/3m0s

running (2m13.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  74% ] 10 VUs  2m13.0s/3m0s

running (2m14.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  74% ] 10 VUs  2m14.0s/3m0s

running (2m15.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  75% ] 10 VUs  2m15.0s/3m0s

running (2m16.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  76% ] 10 VUs  2m16.0s/3m0s

running (2m17.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  76% ] 10 VUs  2m17.0s/3m0s

running (2m18.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  77% ] 10 VUs  2m18.0s/3m0s

running (2m19.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  77% ] 10 VUs  2m19.0s/3m0s

running (2m20.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  78% ] 10 VUs  2m20.0s/3m0s

running (2m21.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  78% ] 10 VUs  2m21.0s/3m0s

running (2m22.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  79% ] 10 VUs  2m22.0s/3m0s

running (2m23.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  79% ] 10 VUs  2m23.0s/3m0s

running (2m24.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  80% ] 10 VUs  2m24.0s/3m0s

running (2m25.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  81% ] 10 VUs  2m25.0s/3m0s

running (2m26.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  81% ] 10 VUs  2m26.0s/3m0s

running (2m27.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  82% ] 10 VUs  2m27.0s/3m0s

running (2m28.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  82% ] 10 VUs  2m28.0s/3m0s

running (2m29.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  83% ] 10 VUs  2m29.0s/3m0s

running (2m30.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  83% ] 10 VUs  2m30.0s/3m0s

running (2m31.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  84% ] 10 VUs  2m31.0s/3m0s

running (2m32.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  84% ] 10 VUs  2m32.0s/3m0s

running (2m33.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  85% ] 10 VUs  2m33.0s/3m0s

running (2m34.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  86% ] 10 VUs  2m34.0s/3m0s

running (2m35.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
stress   [  86% ] 10 VUs  2m35.0s/3m0s

running (2m36.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  87% ] 10 VUs  2m36.0s/3m0s

running (2m37.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  87% ] 10 VUs  2m37.0s/3m0s

running (2m38.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  88% ] 10 VUs  2m38.0s/3m0s

running (2m39.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  88% ] 10 VUs  2m39.0s/3m0s

running (2m40.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  89% ] 10 VUs  2m40.0s/3m0s

running (2m41.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  89% ] 10 VUs  2m41.0s/3m0s

running (2m42.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  90% ] 10 VUs  2m42.0s/3m0s

running (2m43.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  91% ] 10 VUs  2m43.0s/3m0s

running (2m44.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  91% ] 10 VUs  2m44.0s/3m0s

running (2m45.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  92% ] 10 VUs  2m45.0s/3m0s

running (2m46.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  92% ] 10 VUs  2m46.0s/3m0s

running (2m47.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  93% ] 10 VUs  2m47.0s/3m0s

running (2m48.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  93% ] 10 VUs  2m48.0s/3m0s

running (2m49.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  94% ] 10 VUs  2m49.0s/3m0s

running (2m50.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  94% ] 10 VUs  2m50.0s/3m0s

running (2m51.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  95% ] 10 VUs  2m51.0s/3m0s

running (2m52.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  96% ] 10 VUs  2m52.0s/3m0s

running (2m53.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  96% ] 10 VUs  2m53.0s/3m0s

running (2m54.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  97% ] 10 VUs  2m54.0s/3m0s

running (2m55.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  97% ] 10 VUs  2m55.0s/3m0s

running (2m56.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  98% ] 10 VUs  2m56.0s/3m0s

running (2m57.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  98% ] 10 VUs  2m57.0s/3m0s

running (2m58.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  99% ] 10 VUs  2m58.0s/3m0s

running (2m59.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [  99% ] 10 VUs  2m59.0s/3m0s

running (3m00.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress   [ 100% ] 10 VUs  3m00.0s/3m0s

running (3m01.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress ↓ [ 100% ] 10 VUs  3m0s

running (3m02.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress ↓ [ 100% ] 10 VUs  3m0s

running (3m03.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress ↓ [ 100% ] 10 VUs  3m0s

running (3m04.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress ↓ [ 100% ] 10 VUs  3m0s

running (3m05.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress ↓ [ 100% ] 10 VUs  3m0s

running (3m06.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
stress ↓ [ 100% ] 10 VUs  3m0s


  █ THRESHOLDS 

    checks
    ✗ 'rate>0.95' rate=0.00%

    http_req_failed
    ✗ 'rate<0.2' rate=100.00%

    indexing_ready_rate
    ✓ 'rate>0.8' rate=0.00%

    upload_accepted_rate
    ✓ 'rate>0.95' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 60      0.322403/s
    checks_succeeded...: 0.00%   0 out of 60
    checks_failed......: 100.00% 60 out of 60

    ✗ login success
      ↳  0% — ✓ 0 / ✗ 60

    CUSTOM
    indexing_ready_rate....: 0.00%   0 out of 0
    upload_accepted_rate...: 0.00%   0 out of 0

    HTTP
    http_req_duration......: avg=30.01s min=30s med=30s    max=30.05s p(90)=30.03s p(95)=30.04s
    http_req_failed........: 100.00% 60 out of 60
    http_reqs..............: 60      0.322403/s

    EXECUTION
    iteration_duration.....: avg=31.01s min=31s med=31.01s max=31.05s p(90)=31.03s p(95)=31.04s
    iterations.............: 60      0.322403/s
    vus....................: 10      min=10       max=10
    vus_max................: 10      min=10       max=10

    NETWORK
    data_received..........: 28 kB   148 B/s
    data_sent..............: 10 kB   56 B/s



running (3m06.1s), 00/10 VUs, 60 complete and 0 interrupted iterations
stress ✓ [ 100% ] 10 VUs  3m0s